# AnalysisDisplayLegendSettings Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalysisDisplayLegendSettings Constructor
AnalysisDisplayLegendSettings Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AnalysisDisplayLegendSettings()()()() | Constructs a default instance of legend settings. |
| AnalysisDisplayLegendSettings(AnalysisDisplayLegendSettings) | Constructs a new copy of the input AnalysisDisplayLegendSettings object. |

# See Also
AnalysisDisplayLegendSettings Class
AnalysisDisplayLegendSettings Members
Autodesk.Revit.DB.Analysis Namespace